#ifndef EVENT_H
#define EVENT_H

// Event.h
// Здесь объявляется класс Event.
//
// Event — это сеанс, рейс, поездка или фильм.
//
// Что должен хранить Event:
// 1. id события.
// 2. Название события.
// 3. Время начала события.
// 4. Список мест.
// 5. Возможно, пункт отправления и назначения, если это рейс или поезд.
//
// Что должен уметь Event:
// 1. Возвращать информацию о событии.
// 2. Добавлять места.
// 3. Искать место по номеру.
// 4. Возвращать время до начала события.
// 5. Показывать список доступных мест.
//
// Важно:
// Время до события нужно для расчета тарифа.
// Например, чем ближе время рейса, тем дороже может быть билет.

#endif // EVENT_H