#ifndef TICKET_H
#define TICKET_H

// Ticket.h
// Здесь объявляется класс Ticket.
//
// Что должен хранить Ticket:
// 1. id билета.
// 2. id пользователя.
// 3. id события.
// 4. Номер места.
// 5. Категорию места.
// 6. Финальную цену.
// 7. Время создания билета.
//
// Что должен уметь Ticket:
// 1. Возвращать информацию о билете.
// 2. Печатать билет в консоль.
// 3. Хранить итоговую стоимость после применения тарифа.
//
// Важно:
// Ticket создается только после успешной оплаты.
// Если оплата не прошла, Ticket создаваться не должен.

#endif // TICKET_H